polygl0ts/lakectf-23-24-public/finals/pwn-internet-of-shit/src/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 5.2.0 Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y # disable image validation so that we can just create handouts via byte replacement
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y # disable image validation so that we can just create handouts via byte replacement
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
CONFIG_FLAG="EPFL{th3_'S'_1n_IoT_5t4nd5_f0r_53cur1ty}"
CONFIG_ESP_WIFI_AP_SSID="Internet of Shit"
CONFIG_ESP_WIFI_AP_PASSWORD="S0S3cur3"
CONFIG_ESP_MAX_STA_CONN_AP=16
CONFIG_PORT=1337
CONFIG_SDA_GPIO=4
CONFIG_SCL_GPIO=5
CONFIG_LWIP_LOCAL_HOSTNAME="ios-server"
CONFIG_LWIP_NETIF_API=y
CONFIG_LWIP_IRAM_OPTIMIZATION=y
CONFIG_LWIP_EXTRA_IRAM_OPTIMIZATION=y
CONFIG_LWIP_IP4_REASSEMBLY=y
CONFIG_LWIP_IPV6=n
CONFIG_LV_COLOR_DEPTH_1=y
CONFIG_LV_USE_PERF_MONITOR=y
CONFIG_LV_FONT_MONTSERRAT_14=n
CONFIG_LV_FONT_DEFAULT_UNSCII_16=y
CONFIG_LV_BUILD_EXAMPLES=n
